Source: https://www.youtube.com/watch?v=2uvysYbKdjM&t=12s

In [7]:
print("hello world")

hello world

DataFrames

In [10]:
import pandas as pd
print(pd.__file__)
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9],[10,11,12]], columns=["A", "B", "C"], index=["x","y","z",'zz'])
print(df)

d:\Новая папка\OneDrive\Рабочий стол\learning-visualisation-of_data\venv\Lib\site-packages\pandas\__init__.py
     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [ ]:
print("5 lines par default")
df.head() # 5 lines par default
df.head(3)

5 lines par default
5 lines par default

   A  B  C
x  1  2  3
y  4  5  6
z  7  8  9

In [8]:
df.tail(2)

     A   B   C
z    7   8   9
zz  10  11  12

In [11]:
print("df.index.tolist():")
print(df.index.tolist())

print("\ndf.columns:")
print(df.columns)

print("\ndf.info():")
df.info()

df.index.tolist():
['x', 'y', 'z', 'zz']

df.columns:
Index(['A', 'B', 'C'], dtype='object')

df.info():
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, x to zz
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 300.0+ bytes

Python Pandas

In [ ]:
df.describe()
#std - standard deviation

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [13]:
df.nunique()
df['A'].unique()

array([ 1,  4,  7, 10])

In [14]:
df.size # n * m

12

In [15]:
df.shape

(4, 3)

Loading in Dataframes from Files

In [15]:
#results = pd.read_csv('./data/result.csv')
coffee = pd.read_csv('./data/coffee.csv')
bios = pd.read_csv('https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/bios.csv')
results_parquet = pd.read_parquet('./data/results.parquet') # need to be installed pip install pyarrow
regions = pd.read_csv("https://raw.githubusercontent.com/KeithGalli/complete-pandas-tutorial/refs/heads/master/data/noc_regions.csv")
coffee
coffee.sample(10, random_state=1)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35

In [11]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx', sheet_name="results")
#need to install 'pip install openpyxl'
olympics_data.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,17.0,True,NaN
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,NaN
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,NaN,32.0,True,NaN
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,NaN
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,NaN

In [ ]:
import os
print(os.getcwd())       
print(os.listdir('./'))   
print(os.listdir('./data'))

Accessing Data with Pandas

In [16]:
# loc
# coffee.loc[Rows, Columns]

print()
print(coffee.loc[0])
print()
print(coffee.loc[[0,1,5]])
print()
print(coffee.loc[5:9, ["Day", "Units Sold"]])
print()
print(coffee.iloc[:, [0,2]])

Day              Monday
Coffee Type    Espresso
Units Sold           25
Name: 0, dtype: object

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
5  Wednesday       Latte          25

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45
9     Friday          35

          Day  Units Sold
0      Monday          25
1      Monday          15
2     Tuesday          30
3     Tuesday          20
4   Wednesday          35
5   Wednesday          25
6    Thursday          40
7    Thursday          30
8      Friday          45
9      Friday          35
10   Saturday          45
11   Saturday          35
12     Sunday          45
13     Sunday          35

loc - the name of a row or column, but not the position
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.loc.html#pandas.DataFrame.loc

iloc - by row or column number (as in Python lists)
https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.iloc.html#pandas.DataFrame.iloc

Other Stuff

In [ ]:
print()
coffee.index = coffee["Day"] #to change index
print() 
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [ ]:
coffee.loc[1:3, "Units Sold"] = 10 # to set value

# to access only one element
coffee.at[0,"Units Sold"] 
coffee.iat[3,1]

In [18]:
# to access collums
coffee.Day #if its a single word
coffee["Day"]

0        Monday
1        Monday
2       Tuesday
3       Tuesday
4     Wednesday
5     Wednesday
6      Thursday
7      Thursday
8        Friday
9        Friday
10     Saturday
11     Saturday
12       Sunday
13       Sunday
Name: Day, dtype: object

In [ ]:
#Sort Values

print()
coffee.sort_values(["Units Sold"])
print()
coffee.sort_values(["Units Sold"], ascending=False)
print()
coffee.sort_values(["Units Sold", "Coffee Type"], ascending=[0,1])
# 0 → descending
# 1 → ascending

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

##### Iterate over dataframe with for loop

In [ ]:
for index, row in coffee.iterrows():
    print(index)
    print(row)
    print("Coffee Type of Row:", row["Coffee Type"])

#### Filtering Data